Q1. List any five functions of the pandas library with execution.

Five dunctions are :

1: head()

2: describe()

3: loc() 

4:iloc()

5: unique()

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
df['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [7]:
df.iloc[0:10,[1,2,3]]

   Survived  Pclass                                               Name
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry
5         0       3                                   Moran, Mr. James
6         0       1                            McCarthy, Mr. Timothy J
7         0       3                     Palsson, Master. Gosta Leonard
8         1       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9         1       2                Nasser, Mrs. Nicholas (Adele Achem)

In [8]:
df.loc[0:10,["PassengerId","Survived","Pclass","Age"]]

    PassengerId  Survived  Pclass   Age
0             1         0       3  22.0
1             2         1       1  38.0
2             3         1       3  26.0
3             4         1       1  35.0
4             5         0       3  35.0
5             6         0       3   NaN
6             7         0       1  54.0
7             8         0       3   2.0
8             9         1       3  27.0
9            10         1       2  14.0
10           11         1       3   4.0

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [9]:
df[["A", "B", "C"]] = 100

In [10]:
new_df = df[["A", "B", "C"]]

In [11]:
new_df.reindex([i for i in range(1,len(df["A"]),2)])

       A    B    C
1    100  100  100
3    100  100  100
5    100  100  100
7    100  100  100
9    100  100  100
..   ...  ...  ...
881  100  100  100
883  100  100  100
885  100  100  100
887  100  100  100
889  100  100  100

[445 rows x 3 columns]

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [12]:
v = {'Values' :  [10, 20, 30, 40, 50]}

In [13]:
df1 = pd.DataFrame(v)

In [14]:
sum(df1['Values' ][0:3])

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [15]:
def count_(df):
    count = []
    for i in df["text"].values:
        count.append(len(i))
    df['Word_Count'] = count 
    return df

In [16]:
t = {"text" : ["Vanshika","Sam","Nancy","Kapil"]}

In [17]:
df = pd.DataFrame(t)

In [18]:
count_(df)

       text  Word_Count
0  Vanshika           8
1       Sam           3
2     Nancy           5
3     Kapil           5

Q5. How are DataFrame.size() and DataFrame.shape() different?

Syntax: dataframe.size

Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

Syntax: dataframe.shape

Return : Returns tuple of shape (Rows, columns) of dataframe/series

In [19]:
df.size

8

In [20]:
df.shape

(4, 2)

In [21]:
df

       text  Word_Count
0  Vanshika           8
1       Sam           3
2     Nancy           5
3     Kapil           5

Q6. Which function of pandas do we use to read an excel file?

To read an excel file as a DataFrame, use the pandas read_excel() method.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [22]:
def username_(df):
    usr = [i.split("@")[0] for i in df['Email']]
    df['username'] = usr
    return df

In [23]:
email = {"Email" : ["Vanshika@gmail.com","Sam@gmail.com","Nancy@gmail.com","Kapil@gmail.com"]}

In [24]:
df1 = pd.DataFrame(email)

In [25]:
username_(df1)

                Email  username
0  Vanshika@gmail.com  Vanshika
1       Sam@gmail.com       Sam
2     Nancy@gmail.com     Nancy
3     Kapil@gmail.com     Kapil

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:

A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2

Your function should select the following rows:

A B C

1 8 2 7

4 9 1 2

The function should return a new DataFrame that contains only the selected rows.

In [26]:
import pandas as pd

def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows

df = pd.DataFrame({'A': [3, 8, 6, 2, 9],
                   'B': [5, 2, 9, 3, 1],
                   'C': [1, 7, 4, 5, 2]})


selected_df = select_rows(df)


print(selected_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [27]:
import pandas as pd
import numpy as np

def calculate_stats(df):
    # Extract the 'Values' column as a Series
    values = df['Values']
    
    # Calculate the mean, median, and standard deviation
    mean = values.mean()
    median = values.median()
    std = values.std()
    
    # Return the calculated statistics
    return mean, median, std

In [28]:
df = pd.DataFrame({'Values': [3, 8, 6, 2, 9, 10, 7, 5, 1, 4]})

# Call the function to calculate statistics
mean, median, std = calculate_stats(df)

# Print the calculated statistics
print("Mean:", mean)
print("Median:", median)
print("Standard Deviation:", std)

Mean: 5.5
Median: 5.5
Standard Deviation: 3.0276503540974917

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [29]:
data = {'Date':["1999-01-02","1999-01-03","1999-01-04","1999-01-05","1999-01-09","1999-01-10","1999-01-11","1999-01-12","1999-01-13","1999-01-16"],'Sales' : [10,123,4,56,14,643,23,342,34,3]}
def movingaverage(df):
    df['MovingAvrage'] = df['Sales'].rolling(window = 7,min_periods = 1).mean()
    return df
df = pd.DataFrame(data)
movingaverage(df)

         Date  Sales  MovingAvrage
0  1999-01-02     10     10.000000
1  1999-01-03    123     66.500000
2  1999-01-04      4     45.666667
3  1999-01-05     56     48.250000
4  1999-01-09     14     41.400000
5  1999-01-10    643    141.666667
6  1999-01-11     23    124.714286
7  1999-01-12    342    172.142857
8  1999-01-13     34    159.428571
9  1999-01-16      3    159.285714

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:

Date

0 2023-01-01

1 2023-01-02

2 2023-01-03

3 2023-01-04

4 2023-01-05

Your function should create the following DataFrame:

Date Weekday

0 2023-01-01 Sunday

1 2023-01-02 Monday

2 2023-01-03 Tuesday

3 2023-01-04 Wednesday

4 2023-01-05 Thursday

In [46]:
df = pd.DataFrame({'Date' : ["2023-01-01","2023-01-02","2023-01-03" ,"2023-01-04","2023-01-05"],
                   'Weekday' : ["Sunday","Monday","Tuesday","Wednesday","Thursday"]})

In [47]:
print(df)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [52]:
data = {'date': ['2023-01-01', '2023-01-05', '2023-01-31','2023-02-05'], 'sales': [100, 200, 300,1000]}
df1 = pd.DataFrame(data)

x,y = df1[(df1['date'] == "2023-01-01")  | (df1['date'] == '2023-01-31')].index

df1.loc[x:y,df1.columns]

         date  sales
0  2023-01-01    100
1  2023-01-05    200
2  2023-01-31    300

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [ ]:
import pandas